{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Hey",
        "Good morning",
        "Good evening",
        "Good afternoon"
      ],
      "responses": [
        "Hello, how can I help you?",
        "Hi there, how can I assist you?",
        "Hey, how may I help you?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Bye for now",
        "See you soon"
      ],
      "responses": [
        "Goodbye, have a nice day!",
        "See you later, take care.",
        "Bye, have a good one!",
        "I look forward to our next time!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "Thanks a lot",
        "Thank you very much"
      ],
      "responses": [
        "You're welcome!",
        "No problem!",
        "My pleasure.",
        "Anytime!"
      ]
    },
    {
      "tag": "time",
      "patterns": [
        "What are your hours?",
        "When are you open?",
        "What hours are you available?",
        "When can I connect with you?",
        "When can I talk to you?",
        "When can I find you?",
        "When will you open?",
        "When will you close?"
      ],
      "responses": [
        "We are open from 9 am to 8 pm, Monday to Friday.",
        "Our hours are 9 am to 8 pm during the weekdays."
      ]
    },
    {
      "tag": "paymentsCard",
      "patterns": [
        "Do you accept credit cards?",
        "Can I pay with a card?",
        "Are credit cards accepted?"
      ],
      "responses": [
        "Yes, we accept all major credit cards.",
        "We accept most credit cards, including Visa and MasterCard."
      ]
    }
    ,
    {
      "tag": "product_inquiry_book",
      "patterns": [
        "Can I buy books from you?",
        "Can you tell me some product information about the book?",
        "I want to know some information about book.",
        "Is it possible to purchase books through you?",
        "Do you sell books that I can buy?",
        "I'm interested in buying books. Are you selling any?",
        "Could you provide some details about the book?",
        "I would like to know more about the book's features. Can you help?",
        "May I have some specifics on the book you're offering?",
        "I'm looking for some details about the book.",
        "I'm curious about the book. What information can you provide?"

      ],
      "responses": [
        "Well, what would you like to know about book? such as author, title, subject or style",
        "I can provide information on book. If you want to more detail, you can tell me author, title, subject or style",
        "Here are some details for books. How can I assist you further?"
      ]
    },
    {
      "tag": "buy_book_author",
      "patterns": [
        "Are there any books here written by Helen?",
        "Are any of Helen's books available here?",
        "Can I find books authored by Helen here?",
        "I'm looking for books written by Helen, do you carry any?",
        "Are books penned by Helen present here?",
        "Do you sell any books here that Helen wrote?",
        "Can I have some books written by jianghao?",
        "Can I buy some books written by Bob?",
        "Do you have Helen's books for sale?",
        "Are Helen's written works available for purchase in your store?",
        "I’m interested in obtaining books that have been authored by Helen, are they available?",
        "May I find any of Helen's compositions here for sale?"
      ],
      "responses": [
        "Yes, we have several books by her or him.",
        "Indeed, there are a few of works for her or his here",
        "Absolutely, you can find books written by her or him here."
      ]
    },
    {
      "tag": "ask_book_subject",
      "patterns": [
        "Do you have any books on Computer science?",
        "Can I buy books on Math?",
        "Are there any Computer science books available here?",
        "I'm looking for books about Computer programming. Do you carry any?",
        "Could I find books related to History in your collection?",
        "Can I find any works on Computer here?",
        "Could I buy books related to History",
        "Could I have books related to Math",
        "I'm interested in Artificial Intelligence. Do you have books on this topic?"
      ],
      "responses": [
        "Yes, we have several books about it. There is the list about it",
        "Absolutely, you can find books about it here."
      ]
    },
    {
      "tag": "buy_book_style",
      "patterns": [
        "Do you have any mystery novels available here?",
        "I'm looking for books in the mystery genre. Are there any in your collection?",
        "Can I find any detective stories or crime thrillers here?",
        "Are there any books by famous mystery authors available?",
        "Can I find any works about literary here?",
        "Can I find any works about entertainment here?",
        "I'm interested in academic. Do you have books on this topic?",
        "Do you have any fantasy novels available for purchase?",
        "Can I find scientific fiction books for sale here?",
        "Are there any academic novels in stock that I can buy?",
        "I'm looking to buy mystery novels, do you carry any?",
        "Could I purchase historical fiction books from your collection?",
        "Is it possible to buy thrilling novels here?",
        "I’m interested in acquiring some crime novels, do you have them?",
        "Are young adult novels available for sale in your store?",
        "Do you stock any horror novels that I can buy?",
        "Can I purchase classic literature here?",
        "I'm in search of contemporary novels for sale, do you offer any?",
        "Are there any dystopian novels I could buy from your bookstore?",
        "Could I find any adventure novels available for purchase here?",
        "Do you have any detective novels on sale?",
        "I would like to buy some speculative fiction books, are they available?"
      ],
      "responses": [
        "Yes, we have several books about this kind. You can scan the list below"
      ]
    },

    {
      "tag": "ask_book_title",
      "patterns": [
        "'little Red Riding Hood', please",
        "'Harry Potter'",
        "Is 'Harry Potter', available here?",
        "Is 'Robinson Crusoe' available here?",
        "Is 'How the Steel Was Tempered' available here?",
        "Is 'little Red Riding Hood' available here?",
        "Is 'snow White' available here?",
        "Can I find the book called 'Harry Potter' in your collection?",
        "I'm looking for a book named 'Harry Potter'. Do you carry it?",
        "Are there any copies of 'Harry Potter' on your shelves?"
      ],
      "responses": [
        "Yes, we have several books by Helen.",
        "Indeed, there are a few of Helen's works here",
        "Absolutely, you can find books written by Helen here."
      ]
    },
    {
      "tag": "ask_book_all",
      "patterns": [
        "What books are available for purchase here?",
        "Can you tell me which books I can buy here?",
        "I'm looking to buy some books. What do you have in stock?",
        "What titles are currently available for sale?",
        "I'm interested in buying books. What selections do you offer?",
        "Can you recommend any books that are available for purchase?",
        "What books do you currently have that are for sale?"
      ],
      "responses": [
        "We have a wide variety of books available for purchase, covering many genres and interests. Among our collection, we're particularly excited about some of the latest arrivals that have been garnering attention. For instance, '[Latest Book 1]' by [Author 1] offers an intriguing exploration of [brief description of book 1]. Similarly, '[Latest Book 2]' by [Author 2] is a must-read, presenting [brief description of book 2]. We also have '[Latest Book 3]' by [Author 3], which has received rave reviews for its [brief description of book 3]. Feel free to ask for more recommendations or anything specific you're looking for!",
        "We have a wide variety of books available for purchase, you can tell me more detail, such as title or author"
      ]
    },

    {
      "tag": "product_inquiry_SportsEquipment",
      "patterns": [
        "Can I buy some Sport Equipments from you?",
        "Can I buy a Sport Equipment from you?",
        "I want to buy some Sport Equipments",
        "Can you tell me some product information about Sport Equipment?",
        "I want to know some information about Sport Equipment here.",
        "Do you sell Sport Equipments?"
      ],
      "responses": [
        "Sure, there is a list for Sport Equipment, what kind of Sports Equipment would you like to know?",
        "I can provide information on Sports Equipment. What do you need to know?"
      ]
    },

    {
      "tag": "buy_SportsEquipment",
      "patterns": [
        "orange basketball",
        "orange basketball, please",
        "football, please",
        "I want to buy a basketball",
        "Can I buy a basketball from you?",
        "Can I have a green basketball from you?",
        "Can I buy a white football from you?",
        "Can I have a yellow football from you?",
        "Can I buy a badminton racket from you?",
        "Can I have a yellow badminton racket from you?",
        "Can I buy a exercise bike here?",
        "Can I have a exercise bike here?",
        "Can I buy a barbell here?",
        "Can I have a barbell here?",
        "I want to buy a football",
        "I want to buy a orange badminton",
        "I want to buy a ping-pong",
        "Can I buy a ping-pong",
        "I want to buy some ping-pongs",
        "I want to buy some basketballs",
        "I want to buy some footballs",
        "I want to buy a blue basketball",
        "I want to buy a yellow basketball",
        "Can I buy a blue basketball from you?",
        "Do you sell basketball?",
        "Do you sell blue basketball?"

      ],
      "responses": [
        "Sure, this is the list of it, if you want to buy, you can choose your favorite ! If you want to buy it, you can click the button 'BUY'."
      ]
    },

    {
      "tag": "product_inquiry_Stationery",
      "patterns": [
        "Can I buy some stationery from you?",
        "Can I buy a stationery from you?",
        "I want to buy some stationery",
        "Can you tell me some product information about stationery?",
        "I want to know some information about stationery here.",
        "Do you sell stationery?"
      ],
      "responses": [
        "Sure, there is a list for stationery, what kind of stationery would you like to know?",
        "I can provide information on stationery. What kind of stationery do you need to know?"
      ]
    },

    {
      "tag": "buy_Stationery",
      "patterns": [
        "orange pen",
        "orange pencil, please",
        "Pencil, please",
        "I want to buy a Pen",
        "Can I buy a Pencil from you?",
        "Can I have a green eraser from you?",
        "Can I buy a black ink from you?",
        "Can I have a yellow pencil from you?",
        "Can I buy a ruler from you?",
        "Can I have a yellow ruler from you?",
        "Can I buy a pencil sharpener here?",
        "Can I have a compass here?",
        "Can I buy a calculator here?",
        "Can I have a calculator here?",
        "I want to buy a compass",
        "I want to buy a orange pencil",
        "I want to buy a pen",
        "Can I buy a marker?",
        "I want to buy some ping-pongs",
        "I want to buy some basketballs",
        "I want to buy some markers",
        "I want to buy a blue ink",
        "Can I buy a blue calculator from you?",
        "Do you sell calculator?",
        "Do you sell blue pen?"

      ],
      "responses": [
        "Sure, this is the list of it, if you want to buy, you can choose your favorite ! If you want to buy it, you can click the button 'BUY'."
      ]
    },

    {
      "tag": "order_status",
      "patterns": [
        "Where is my order?",
        "Can I get an update on my order status?",
        "How do I track my order?",
        "Can I check my order?",
        "Can I check the status of my order?"
      ],
      "responses": [
        "Can you provide your order ID or for me to check?",
        "I'm checking your order status right now. Can I have your order number?",
        "To track your order, please enter your order username."
      ]
    },
    {
      "tag": "payment_options",
      "patterns": [
        "What payment methods do you accept?",
        "Can I pay using PayPal?",
        "Do you accept credit cards?"
      ],
      "responses": [
        "We accept various payment methods including credit cards, PayPal, and bank transfers.",
        "Well, PayPal is accepted here along with other major payment methods.",
        "We accept all major credit cards, PayPal, and other payment options."
      ]
    },
    {
      "tag": "return_policy",
      "patterns": [
        "What's your return policy?",
        "Can I return a product if I don't like it?",
        "How do I return something I bought?"
      ],
      "responses": [
        "Our return policy allows you to return products within 30 days of receiving them.",
        "Yes, if you are not satisfied with your purchase, you can return it within the return period.",
        "To return a product, please follow the return process outlined on our website or contact customer support."
      ]
    },
    {
      "tag": "shipping_info",
      "patterns": [
        "How long does shipping take?",
        "What shipping options do I have?",
        "Do you offer international shipping?"
      ],
      "responses": [
        "Shipping times vary by destination but typically take between 3-5 business days.",
        "We offer standard, expedited, and international shipping options.",
        "Yes, we offer international shipping. Shipping times and costs vary depending on the destination."
      ]
    }

  ]
}